copify-api/app/controllers/items_controller.rb

    def index
        inventory = Item.all
---
SELECT "items".* FROM "items"

    def create
        item = Item.create(
            purchase_date: params[:purchase_date],
            name: params[:name],
            brand: params[:brand],
            size: params[:size],
            cost: params[:cost]
        )
---
INSERT INTO "items" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-02-17 01:31:41.676966"], ["updated_at", "2021-02-17 01:31:41.676966"]]

    def update
        item = Item.find_by(id: params[:id])
        item.update(
            purchase_date: params[:purchase_date],
            name: params[:name],
            brand: params[:brand],
            size: params[:size],
            cost: params[:cost]
        )
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "items" SET "purchase_date" = ?, "name" = ?, "brand" = ?, "size" = ?, "cost" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["purchase_date", "2021-02-02"], ["name", "Box LogoA"], ["brand", "A"], ["size", "XXL"], ["cost", 181.0], ["updated_at", "2021-02-19 02:12:27.898742"], ["id", 28]]

    def destroy
        item = Item.find_by(id: [params:id])
        item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 13]]